<a href="https://colab.research.google.com/github/glebmikha/sql-course/blob/main/sql_with_gleb_mikhaylov_course.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# SQL для анализа данных с Глебом Михайловым

Мой канал в Телеграм: https://t.me/mikhaylovgleb  
Мой канал на Ютюб: https://www.youtube.com/c/GlebMikhaylov  
Мой сайт: https://glebmikhaylov.com/

# Заливка данных

https://stackoverflow.com/a/59429952/4527289

In [ ]:
!gdown --id 1BSHIKQ7rFw5BpTq5nw1UZfjPK_7Mpnbi
!mv _sqlite3.cpython-37m-x86_64-linux-gnu.so /usr/lib/python3.7/lib-dynload/
import os
os.kill(os.getpid(), 9)

Downloading...
From: https://drive.google.com/uc?id=1BSHIKQ7rFw5BpTq5nw1UZfjPK_7Mpnbi
To: /content/_sqlite3.cpython-37m-x86_64-linux-gnu.so
6.23MB [00:00, 98.0MB/s]

In [1]:
import pandas as pd
import numpy as np

In [2]:
import sqlite3

In [3]:
sqlite3.sqlite_version

'3.34.1'

In [4]:
con = sqlite3.connect('db')

https://drive.google.com/file/d/1Gj0qVU0Acv-HqRjTIEwvkO4TqJYijehR/view?usp=sharing

In [5]:
!gdown --id 1Gj0qVU0Acv-HqRjTIEwvkO4TqJYijehR

Downloading...
From: https://drive.google.com/uc?id=1Gj0qVU0Acv-HqRjTIEwvkO4TqJYijehR
To: /content/german_credit_augmented.csv
100% 69.6k/69.6k [00:00<00:00, 29.3MB/s]

In [6]:
df = pd.read_csv('/content/german_credit_augmented.csv')

In [7]:
df.head()

   age     sex  job housing  ...    purpose default          contract_dt  client_id
0   33    male    2     own  ...   radio/TV       0  2008-06-29 18:52:00        210
1   43    male    1     own  ...        car       0  2007-05-20 18:30:19        929
2   52    male    2     own  ...  education       0  2008-04-27 08:23:07        200
3   35  female    3     own  ...        car       0  2007-05-06 10:58:22         45
4   28    male    2     own  ...   radio/TV       0  2007-07-21 13:22:14        358

[5 rows x 12 columns]

In [8]:
df['contract_dt'] = pd.to_datetime(df['contract_dt'],format='%Y-%m-%d %H:%M:%S')

In [9]:
df.dtypes

age                          int64
sex                         object
job                          int64
housing                     object
saving_accounts             object
checking_account            object
credit_amount                int64
duration                     int64
purpose                     object
default                      int64
contract_dt         datetime64[ns]
client_id                    int64
dtype: object

In [10]:
df.to_sql('german_credit',con,index=False,if_exists='replace')

# Select

## Псевдонимы

In [11]:
def select(sql):
  return pd.read_sql(sql,con)

In [12]:
sql = '''SELECT t.age * 3 AS age_mult3,
       t.housing
FROM german_credit AS t
'''

In [13]:
select(sql)

     age_mult3 housing
0           99     own
1          129     own
2          156     own
3          105     own
4           84     own
..         ...     ...
995        195    free
996         90     own
997         99     own
998         87     own
999        132     own

[1000 rows x 2 columns]

## Манипуляции со столбцами

In [14]:
sql = '''select t.*, 
t.age * 3 as age_mult3,
t.age + t.credit_amount as age_plus_amount,
t.age * 1.0 / t.credit_amount as age_div_amount,

t.age as age_2


 from german_credit t'''

In [15]:
select(sql)

     age     sex  job  ... age_plus_amount age_div_amount age_2
0     33    male    2  ...            3107       0.010735    33
1     43    male    1  ...            1387       0.031994    43
2     52    male    2  ...             988       0.055556    52
3     35  female    3  ...            1428       0.025126    35
4     28    male    2  ...             804       0.036082    28
..   ...     ...  ...  ...             ...            ...   ...
995   65    male    2  ...            2665       0.025000    65
996   30    male    3  ...            4485       0.006734    30
997   33    male    2  ...            6436       0.005154    33
998   29  female    2  ...            5032       0.005797    29
999   44    male    2  ...            1848       0.024390    44

[1000 rows x 16 columns]

## Where

In [16]:
df.head()

   age     sex  job housing  ...    purpose default         contract_dt  client_id
0   33    male    2     own  ...   radio/TV       0 2008-06-29 18:52:00        210
1   43    male    1     own  ...        car       0 2007-05-20 18:30:19        929
2   52    male    2     own  ...  education       0 2008-04-27 08:23:07        200
3   35  female    3     own  ...        car       0 2007-05-06 10:58:22         45
4   28    male    2     own  ...   radio/TV       0 2007-07-21 13:22:14        358

[5 rows x 12 columns]

In [17]:
sql = '''select * from german_credit t limit 5'''

In [18]:
select(sql)

   age     sex  job housing  ...    purpose default          contract_dt  client_id
0   33    male    2     own  ...   radio/TV       0  2008-06-29 18:52:00        210
1   43    male    1     own  ...        car       0  2007-05-20 18:30:19        929
2   52    male    2     own  ...  education       0  2008-04-27 08:23:07        200
3   35  female    3     own  ...        car       0  2007-05-06 10:58:22         45
4   28    male    2     own  ...   radio/TV       0  2007-07-21 13:22:14        358

[5 rows x 12 columns]

In [19]:
sql = '''select count(1) from german_credit t 
where t.contract_dt between '2007-01-01' and '2007-12-31'
'''

In [20]:
select(sql)

   count(1)
0       573

In [21]:
sql = '''select * from german_credit t 
where t.contract_dt between '2007-01-01' and '2007-12-31'
and t.purpose in ('car' ,'repairs')

order by t.contract_dt desc, credit_amount 
'''

In [22]:
select(sql)

     age     sex  job housing  ...  purpose default          contract_dt  client_id
0     36    male    3    rent  ...      car       0  2007-12-29 16:10:08         99
1     30    male    2     own  ...  repairs       1  2007-12-28 17:09:43        127
2     25    male    2    rent  ...      car       1  2007-12-28 08:38:58        979
3     48    male    2     own  ...      car       0  2007-12-24 16:28:30         20
4     67  female    2     own  ...  repairs       0  2007-12-24 12:25:28        779
..   ...     ...  ...     ...  ...      ...     ...                  ...        ...
192   55    male    2     own  ...      car       0  2007-05-05 06:35:11        209
193   55  female    0    free  ...  repairs       1  2007-05-05 00:14:17        429
194   47    male    3     own  ...      car       1  2007-05-03 10:29:01        485
195   36    male    2     own  ...      car       1  2007-05-02 06:22:11        184
196   31    male    2     own  ...      car       1  2007-05-01 23:14:02        598

[197 rows x 12 columns]

## Like

In [23]:
t = pd.DataFrame({'purpose':['машина','на машину','на покупку машины','автомобиль','на возвращение 2007'],
              'amount':[1000,400,600,700,1500]})

In [24]:
t

               purpose  amount
0               машина    1000
1            на машину     400
2    на покупку машины     600
3           автомобиль     700
4  на возвращение 2007    1500

In [25]:
t.to_sql('purpose',con,index=False,if_exists='replace')

In [26]:
sql = '''select * from purpose t'''

In [27]:
select(sql)

               purpose  amount
0               машина    1000
1            на машину     400
2    на покупку машины     600
3           автомобиль     700
4  на возвращение 2007    1500

In [28]:
sql = '''select * from purpose t
where (t.purpose like '%машин%'
or t.purpose like '%авто%') and t.amount > 500
'''

In [29]:
select(sql)

             purpose  amount
0             машина    1000
1  на покупку машины     600
2         автомобиль     700

In [30]:
sql = '''select count(*) from german_credit t'''

In [31]:
select(sql)

   count(*)
0      1000

In [32]:
sql = '''select count(*) from german_credit t
where t.credit_amount > 1000'''

In [33]:
select(sql)

   count(*)
0       884

In [34]:
884/1000

0.884

In [35]:
sql = '''select t.credit_amount,
case when t.credit_amount > 1000 then 1 else 0 end as greater_1000_flag,

iif(t.credit_amount > 1000,1,0) as greater_1000_flag2

 from german_credit t'''

In [36]:
select(sql)

     credit_amount  greater_1000_flag  greater_1000_flag2
0             3074                  1                   1
1             1344                  1                   1
2              936                  0                   0
3             1393                  1                   1
4              776                  0                   0
..             ...                ...                 ...
995           2600                  1                   1
996           4455                  1                   1
997           6403                  1                   1
998           5003                  1                   1
999           1804                  1                   1

[1000 rows x 3 columns]

In [37]:
sql = '''select 
avg(case when t.credit_amount > 1000 then 1 else 0 end) as greater_1000_frac
 from german_credit t'''

In [38]:
select(sql)

   greater_1000_frac
0              0.884

## Create table

In [39]:
sql = '''select * from german_credit t
where t.credit_amount > 1000'''

In [40]:
select(sql)

     age     sex  job  ... default          contract_dt client_id
0     33    male    2  ...       0  2008-06-29 18:52:00       210
1     43    male    1  ...       0  2007-05-20 18:30:19       929
2     35  female    3  ...       0  2007-05-06 10:58:22        45
3     27  female    2  ...       0  2008-06-18 04:10:05        86
4     26    male    2  ...       1  2007-11-29 00:20:44       639
..   ...     ...  ...  ...     ...                  ...       ...
879   65    male    2  ...       1  2007-12-16 20:17:19       624
880   30    male    3  ...       1  2007-07-12 14:08:58       181
881   33    male    2  ...       0  2008-04-08 03:24:26       730
882   29  female    2  ...       1  2007-11-29 15:51:45       557
883   44    male    2  ...       0  2007-08-14 09:05:33        23

[884 rows x 12 columns]

In [41]:
cur = con.cursor()

In [42]:
sql = '''
drop table if exists greater_1000_credit;
create table greater_1000_credit as
select * from german_credit t
where t.credit_amount > 1000'''

In [43]:
cur.executescript(sql)

In [44]:
sql = '''select * from greater_1000_credit t'''

In [45]:
select(sql)

     age     sex  job  ... default          contract_dt client_id
0     33    male    2  ...       0  2008-06-29 18:52:00       210
1     43    male    1  ...       0  2007-05-20 18:30:19       929
2     35  female    3  ...       0  2007-05-06 10:58:22        45
3     27  female    2  ...       0  2008-06-18 04:10:05        86
4     26    male    2  ...       1  2007-11-29 00:20:44       639
..   ...     ...  ...  ...     ...                  ...       ...
879   65    male    2  ...       1  2007-12-16 20:17:19       624
880   30    male    3  ...       1  2007-07-12 14:08:58       181
881   33    male    2  ...       0  2008-04-08 03:24:26       730
882   29  female    2  ...       1  2007-11-29 15:51:45       557
883   44    male    2  ...       0  2007-08-14 09:05:33        23

[884 rows x 12 columns]

## Create table postgres

In [46]:
from sqlalchemy import create_engine
con_pg = create_engine('postgresql+psycopg2://artoxeig:IeNTfTHOt3TKuBgRXNrXO6IybHwuShdF@hattie.db.elephantsql.com:5432/artoxeig')

/usr/local/lib/python3.7/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

In [47]:
def select_pg(sql):
  return pd.read_sql(sql,con_pg)

In [48]:
sql = '''select * from german_credit t
where t.credit_amount > 1000'''

In [49]:
select_pg(sql)

     age     sex  job  ... default         contract_dt client_id
0     33    male    2  ...       0 2008-06-29 18:52:00       210
1     43    male    1  ...       0 2007-05-20 18:30:19       929
2     35  female    3  ...       0 2007-05-06 10:58:22        45
3     27  female    2  ...       0 2008-06-18 04:10:05        86
4     26    male    2  ...       1 2007-11-29 00:20:44       639
..   ...     ...  ...  ...     ...                 ...       ...
879   65    male    2  ...       1 2007-12-16 20:17:19       624
880   30    male    3  ...       1 2007-07-12 14:08:58       181
881   33    male    2  ...       0 2008-04-08 03:24:26       730
882   29  female    2  ...       1 2007-11-29 15:51:45       557
883   44    male    2  ...       0 2007-08-14 09:05:33        23

[884 rows x 12 columns]

In [50]:
sql = '''
drop table if exists greater_1000_credit;
create table greater_1000_credit as
select * from german_credit t
where t.credit_amount > 1000'''

In [51]:
con_pg.execute(sql)

In [52]:
sql = '''select * from greater_1000_credit t'''

In [53]:
select_pg(sql)

     age     sex  job  ... default         contract_dt client_id
0     33    male    2  ...       0 2008-06-29 18:52:00       210
1     43    male    1  ...       0 2007-05-20 18:30:19       929
2     35  female    3  ...       0 2007-05-06 10:58:22        45
3     27  female    2  ...       0 2008-06-18 04:10:05        86
4     26    male    2  ...       1 2007-11-29 00:20:44       639
..   ...     ...  ...  ...     ...                 ...       ...
879   65    male    2  ...       1 2007-12-16 20:17:19       624
880   30    male    3  ...       1 2007-07-12 14:08:58       181
881   33    male    2  ...       0 2008-04-08 03:24:26       730
882   29  female    2  ...       1 2007-11-29 15:51:45       557
883   44    male    2  ...       0 2007-08-14 09:05:33        23

[884 rows x 12 columns]

## Union all

In [54]:
jan = pd.DataFrame({'month':['jan','jan'],'revenue':[1,2]})
feb = pd.DataFrame({'month':['feb','feb'],'revenue':[1,2]})

In [55]:
jan.to_sql('jan',con,index=False,if_exists='replace')
feb.to_sql('feb',con,index=False,if_exists='replace')

In [56]:
sql = '''select * from jan t
union all
select * from feb t'''

In [57]:
select(sql)

  month  revenue
0   jan        1
1   jan        2
2   feb        1
3   feb        2

In [58]:
sql = '''select t.revenue from jan t
union
select t.revenue from feb t'''

In [59]:
select(sql)

   revenue
0        1
1        2

In [60]:
sql = '''select t.revenue,
'jan' as month
 from jan t
union all
select t.revenue,
'mar' as month
 from feb t'''

In [61]:
select(sql)

   revenue month
0        1   jan
1        2   jan
2        1   mar
3        2   mar

## Специальные функции

In [62]:
sql = '''select t.sex, substr(t.sex,1,1) from german_credit t'''

In [63]:
select(sql)

        sex substr(t.sex,1,1)
0      male                 m
1      male                 m
2      male                 m
3    female                 f
4      male                 m
..      ...               ...
995    male                 m
996    male                 m
997    male                 m
998  female                 f
999    male                 m

[1000 rows x 2 columns]

In [64]:
sql = '''select t.sex,
substring(t.sex,1,1),

left(t.sex,1)

 from german_credit t'''

In [65]:
select_pg(sql)

        sex substring left
0      male         m    m
1      male         m    m
2      male         m    m
3    female         f    f
4      male         m    m
..      ...       ...  ...
995    male         m    m
996    male         m    m
997    male         m    m
998  female         f    f
999    male         m    m

[1000 rows x 3 columns]

# Group by

## Сводная таблица

In [66]:
sql = '''
select 
t.sex,

count(*) as cnt,
avg(t.credit_amount) as credit_amount_avg

 from german_credit t
 group by t.sex
 '''

In [67]:
select(sql)

      sex  cnt  credit_amount_avg
0  female  310        2877.774194
1    male  690        3448.040580

In [68]:
df.groupby('sex')['credit_amount'].agg(['count','mean'])

        count         mean
sex
female    310  2877.774194
male      690  3448.040580

In [69]:
sql = '''select count(distinct t.housing), count(t.housing) from german_credit t'''

In [70]:
select(sql)

   count(distinct t.housing)  count(t.housing)
0                          3              1000

In [71]:
sql = '''
select 
t.housing,

count(*) as cnt,
avg(t.credit_amount) as credit_amount_avg

 from german_credit t
 group by t.housing
 '''

In [72]:
select(sql)

  housing  cnt  credit_amount_avg
0    free  108        4906.212963
1     own  713        3060.939691
2    rent  179        3122.553073

## Пропуски

In [73]:
sql = '''select count(t.checking_account), count(0) from german_credit t'''

In [74]:
select(sql)

   count(t.checking_account)  count(0)
0                        606      1000

In [75]:
sql = '''
select 
t.checking_account,

count(*) as cnt,
avg(t.credit_amount) as credit_amount_avg

 from german_credit t
 group by t.checking_account
 '''

In [76]:
select(sql)

  checking_account  cnt  credit_amount_avg
0             None  394        3133.101523
1           little  274        3175.218978
2         moderate  269        3827.561338
3             rich   63        2177.650794

In [77]:
df.groupby('checking_account',dropna=False)['credit_amount'].count()

checking_account
little      274
moderate    269
rich         63
NaN         394
Name: credit_amount, dtype: int64

In [78]:
sql = '''select 
sum(case when t.checking_account is null then 1 else 0 end) as is_null,

count(case when t.checking_account is null then 1 else null end) as is_null2

 from german_credit t'''

In [79]:
select(sql)

   is_null  is_null2
0      394       394

In [80]:
t = pd.DataFrame({'col1':[1,np.nan,2]})

In [81]:
t

   col1
0   1.0
1   NaN
2   2.0

In [82]:
t.to_sql('null_test',con,index=False,if_exists='replace')

In [83]:
t

   col1
0   1.0
1   NaN
2   2.0

In [84]:
(1 + 2) / 3

1.0

In [85]:
(1 + 0 + 2) / 3

1.0

In [86]:
sql = '''select avg(t.col1) from null_test t'''

In [87]:
select(sql)

   avg(t.col1)
0          1.5

In [88]:
sql = '''select

t.checking_account,

coalesce(t.checking_account,'no_info')

 from german_credit t'''

In [89]:
select(sql)

    checking_account coalesce(t.checking_account,'no_info')
0               None                                no_info
1             little                                 little
2               None                                no_info
3               None                                no_info
4               None                                no_info
..               ...                                    ...
995           little                                 little
996         moderate                               moderate
997         moderate                               moderate
998             None                                no_info
999         moderate                               moderate

[1000 rows x 2 columns]

In [90]:
sql = '''select avg(coalesce(t.col1,0)) from null_test t'''

In [91]:
select(sql)

   avg(coalesce(t.col1,0))
0                      1.0

In [92]:
t = pd.DataFrame({'col1':[1,np.nan,2],
                  'col2':[np.nan,np.nan,1],
                  'col3':[1,2,3]})

In [93]:
t

   col1  col2  col3
0   1.0   NaN     1
1   NaN   NaN     2
2   2.0   1.0     3

In [94]:
t.to_sql('null_test',con,index=False,if_exists='replace')

In [95]:
sql = '''select t.*, coalesce(t.col1,t.col2,t.col3) from null_test t'''

In [96]:
select(sql)

   col1  col2  col3  coalesce(t.col1,t.col2,t.col3)
0   1.0   NaN     1                             1.0
1   NaN   NaN     2                             2.0
2   2.0   1.0     3                             2.0

## Дубликаты

In [97]:
t = pd.DataFrame({'id':[1,1,2],'name':['a','a','b']})

In [98]:
t

   id name
0   1    a
1   1    a
2   2    b

In [99]:
t.to_sql('dupl_test',con,index=False,if_exists='replace')

In [100]:
sql = '''select * from dupl_test t'''

In [101]:
select(sql)

   id name
0   1    a
1   1    a
2   2    b

In [102]:
sql = '''select t.id, t.name, count(1) as cnt from dupl_test t
group by t.id, t.name
'''

In [103]:
select(sql)

   id name  cnt
0   1    a    2
1   2    b    1

In [104]:
sql = '''select t.id, t.name, count(1) as cnt from dupl_test t
group by t.id, t.name
having count(1) > 1
'''

In [105]:
select(sql)

   id name  cnt
0   1    a    2

In [106]:
t = pd.DataFrame({'id':[1,1,2,2,3],
                  'name':['a','b','c','d','e']})

In [107]:
t

   id name
0   1    a
1   1    b
2   2    c
3   2    d
4   3    e

In [108]:
t.to_sql('dupl_test',con,index=False,if_exists='replace')

In [109]:
sql = '''select * from dupl_test t'''

In [110]:
select(sql)

   id name
0   1    a
1   1    b
2   2    c
3   2    d
4   3    e

In [111]:
sql = '''select t.id, count(1) as cnt from dupl_test t
group by t.id
having count(1) > 1
'''

In [112]:
select(sql)

   id  cnt
0   1    2
1   2    2

In [113]:
sql = '''select * from dupl_test t
where t.id in (1,2)'''

In [114]:
select(sql)

   id name
0   1    a
1   1    b
2   2    c
3   2    d

In [115]:
sql = '''select t.id as cnt from dupl_test t
group by t.id
having count(1) > 1
'''

In [116]:
select(sql)

   cnt
0    1
1    2

In [117]:
sql = '''select * from dupl_test t
where t.id in (select t.id as cnt from dupl_test t
group by t.id
having count(1) > 1)'''

In [118]:
select(sql)

   id name
0   1    a
1   1    b
2   2    c
3   2    d

## Агрегация

In [119]:
sql = '''select date(t.contract_dt,'start of month') as month,
count(1) as credit_cnt,
count(distinct t.client_id) as client_id_unique,
sum(t.credit_amount) as credit_amount_sum,
avg(t.credit_amount) as credit_amount_avg

 from german_credit t
 group by date(t.contract_dt,'start of month')
 order by date(t.contract_dt,'start of month')
 '''

In [120]:
select(sql)

         month  credit_cnt  ...  credit_amount_sum  credit_amount_avg
0   2007-05-01          81  ...             207663        2563.740741
1   2007-06-01          74  ...             239594        3237.756757
2   2007-07-01          71  ...             224333        3159.619718
3   2007-08-01          57  ...             178569        3132.789474
4   2007-09-01          58  ...             186909        3222.568966
5   2007-10-01          70  ...             188534        2693.342857
6   2007-11-01          87  ...             300504        3454.068966
7   2007-12-01          77  ...             273973        3558.090909
8   2008-01-01          93  ...             288080        3097.634409
9   2008-02-01          55  ...             211128        3838.690909
10  2008-03-01          63  ...             204944        3253.079365
11  2008-04-01          85  ...             305409        3593.047059
12  2008-05-01          67  ...             263043        3926.014925
13  2008-06-01          62  ...             198575        3202.822581

[14 rows x 5 columns]

In [121]:
pd.Series(range(600)).sample(1000,replace=True)

317    317
80      80
273    273
146    146
451    451
      ...
209    209
563    563
263    263
123    123
125    125
Length: 1000, dtype: int64

In [122]:
df['client_id_2'] = pd.Series(range(600)).sample(1000,replace=True).values

In [123]:
df.to_sql('german_credit_not_unieque',con,index=False,if_exists='replace')

In [124]:
sql = '''select 
date(t.contract_dt,'start of month') as month,
count(1) as credit_cnt,
count(distinct t.client_id_2) as client_id_unique,
sum(t.credit_amount) as credit_amount_sum,
avg(t.credit_amount) as credit_amount_avg

 from german_credit_not_unieque t
 group by date(t.contract_dt,'start of month')
 order by date(t.contract_dt,'start of month')
 '''

In [125]:
select(sql)

         month  credit_cnt  ...  credit_amount_sum  credit_amount_avg
0   2007-05-01          81  ...             207663        2563.740741
1   2007-06-01          74  ...             239594        3237.756757
2   2007-07-01          71  ...             224333        3159.619718
3   2007-08-01          57  ...             178569        3132.789474
4   2007-09-01          58  ...             186909        3222.568966
5   2007-10-01          70  ...             188534        2693.342857
6   2007-11-01          87  ...             300504        3454.068966
7   2007-12-01          77  ...             273973        3558.090909
8   2008-01-01          93  ...             288080        3097.634409
9   2008-02-01          55  ...             211128        3838.690909
10  2008-03-01          63  ...             204944        3253.079365
11  2008-04-01          85  ...             305409        3593.047059
12  2008-05-01          67  ...             263043        3926.014925
13  2008-06-01          62  ...             198575        3202.822581

[14 rows x 5 columns]

## Интервалы (или бины или бакеты)

In [126]:
sql = '''select count(distinct t.credit_amount) from german_credit t'''

In [127]:
select(sql)

   count(distinct t.credit_amount)
0                              921

In [128]:
sql = '''select t.credit_amount,

case when t.credit_amount < 1000 then '1. <1000'
when t.credit_amount < 2000 then '2. 1000-2000' 
when t.credit_amount < 3000 then '3. 2000-3000'
when t.credit_amount >= 3000 then '4. >= 3000'

else 'other' end as credit_amount_bin

 from german_credit t'''

In [129]:
select(sql)

     credit_amount credit_amount_bin
0             3074        4. >= 3000
1             1344      2. 1000-2000
2              936          1. <1000
3             1393      2. 1000-2000
4              776          1. <1000
..             ...               ...
995           2600      3. 2000-3000
996           4455        4. >= 3000
997           6403        4. >= 3000
998           5003        4. >= 3000
999           1804      2. 1000-2000

[1000 rows x 2 columns]

In [130]:
sql = '''select 

case 
when t.credit_amount < 1000 then '1. <1000'
when t.credit_amount < 2000 then '2. 1000-2000' 
when t.credit_amount < 3000 then '3. 2000-3000'
when t.credit_amount >= 3000 then '4. >= 3000'

else 'other' end as credit_amount_bin,

count(1) as credit_cnt

 from german_credit t
 group by 1
 '''

In [131]:
select(sql)

  credit_amount_bin  credit_cnt
0          1. <1000         116
1      2. 1000-2000         316
2      3. 2000-3000         188
3        4. >= 3000         380

## Столбцы сводной таблицы

In [132]:
sql = '''select t.housing, 

count(case when t.sex = 'female' then 1 else null end) as female,
count(case when t.sex = 'male' then 1 else null end) as male,

count(1) as cnt 

from german_credit t
group  by t.housing'''

In [133]:
select(sql)

  housing  female  male  cnt
0    free      19    89  108
1     own     196   517  713
2    rent      95    84  179

In [134]:
sql = '''select distinct t.purpose from german_credit t'''

In [135]:
purpose = list(select(sql)['purpose'].values)

In [136]:
purpose

['radio/TV',
 'car',
 'education',
 'furniture/equipment',
 'repairs',
 'business',
 'domestic appliances',
 'vacation/others']

In [137]:
for p in purpose:
  print(f"count(case when t.purpose = '{p}' then 1 else null end) as {p.lower().replace(' ','').replace('/','')},")

count(case when t.purpose = 'radio/TV' then 1 else null end) as radiotv,
count(case when t.purpose = 'car' then 1 else null end) as car,
count(case when t.purpose = 'education' then 1 else null end) as education,
count(case when t.purpose = 'furniture/equipment' then 1 else null end) as furnitureequipment,
count(case when t.purpose = 'repairs' then 1 else null end) as repairs,
count(case when t.purpose = 'business' then 1 else null end) as business,
count(case when t.purpose = 'domestic appliances' then 1 else null end) as domesticappliances,
count(case when t.purpose = 'vacation/others' then 1 else null end) as vacationothers,

In [138]:
sql = '''select t.housing, 

count(case when t.purpose = 'radio/TV' then 1 else null end) as radiotv,
count(case when t.purpose = 'car' then 1 else null end) as car,
count(case when t.purpose = 'education' then 1 else null end) as education,
count(case when t.purpose = 'furniture/equipment' then 1 else null end) as furnitureequipment,
count(case when t.purpose = 'repairs' then 1 else null end) as repairs,
count(case when t.purpose = 'business' then 1 else null end) as business,
count(case when t.purpose = 'domestic appliances' then 1 else null end) as domesticappliances,
count(case when t.purpose = 'vacation/others' then 1 else null end) as vacationothers,
count(1) as cnt 

from german_credit t
group  by t.housing'''

In [139]:
select(sql)

  housing  radiotv  car  ...  domesticappliances  vacationothers  cnt
0    free       15   55  ...                   0               4  108
1     own      227  219  ...                  10               8  713
2    rent       38   63  ...                   2               0  179

[3 rows x 10 columns]

## Категории из текстовых данных

In [140]:
t = pd.DataFrame({'purpose':['машина','машина','машина','на машину','на покупку машины',
                             'автомобиль','на возвращение 2007', 
                             'на свадьбу','свадьба','свадьба','свадьба','для свадьбы',
                             'недвижимость','на покупку недвижимости']})

In [141]:
t

                    purpose
0                    машина
1                    машина
2                    машина
3                 на машину
4         на покупку машины
5                автомобиль
6       на возвращение 2007
7                на свадьбу
8                   свадьба
9                   свадьба
10                  свадьба
11              для свадьбы
12             недвижимость
13  на покупку недвижимости

In [142]:
t.to_sql('purpose',con,index=False,if_exists='replace')

In [143]:
df.head()

   age     sex  job  ...         contract_dt client_id client_id_2
0   33    male    2  ... 2008-06-29 18:52:00       210         544
1   43    male    1  ... 2007-05-20 18:30:19       929         221
2   52    male    2  ... 2008-04-27 08:23:07       200         422
3   35  female    3  ... 2007-05-06 10:58:22        45         540
4   28    male    2  ... 2007-07-21 13:22:14       358          90

[5 rows x 13 columns]

In [144]:
sql = '''select * from purpose t'''

In [145]:
select(sql)

                    purpose
0                    машина
1                    машина
2                    машина
3                 на машину
4         на покупку машины
5                автомобиль
6       на возвращение 2007
7                на свадьбу
8                   свадьба
9                   свадьба
10                  свадьба
11              для свадьбы
12             недвижимость
13  на покупку недвижимости

In [146]:
sql = '''select t.purpose, count(1) from purpose t
group by t.purpose
order by count(1) desc'''

In [147]:
select(sql)

                   purpose  count(1)
0                  свадьба         3
1                   машина         3
2             недвижимость         1
3               на свадьбу         1
4  на покупку недвижимости         1
5        на покупку машины         1
6                на машину         1
7      на возвращение 2007         1
8              для свадьбы         1
9               автомобиль         1

In [148]:
cat = '''select t.purpose,

case when t.purpose like '%свадьб%' then 'свадьба'
when t.purpose like '%машин%' or t.purpose like '%авто%' then 'машина'
when t.purpose like '%недвиж%' then 'недвижимость'

else 'другое' end as purpose_cat

 from purpose t'''

In [149]:
select(cat)

                    purpose   purpose_cat
0                    машина        машина
1                    машина        машина
2                    машина        машина
3                 на машину        машина
4         на покупку машины        машина
5                автомобиль        машина
6       на возвращение 2007        другое
7                на свадьбу       свадьба
8                   свадьба       свадьба
9                   свадьба       свадьба
10                  свадьба       свадьба
11              для свадьбы       свадьба
12             недвижимость  недвижимость
13  на покупку недвижимости  недвижимость

In [150]:
sql = f'''select 
t.purpose_cat,

count(1)

 from ({cat}) t
 group by t.purpose_cat'''

In [151]:
select(sql)

    purpose_cat  count(1)
0        другое         1
1        машина         6
2  недвижимость         2
3       свадьба         5

In [152]:
sql = f'''select t.purpose, count(1) 

from ({cat}) t
where t.purpose_cat = 'другое'


group by t.purpose

order by count(1) desc'''

In [153]:
select(sql)

               purpose  count(1)
0  на возвращение 2007         1

# Подзапросы

## Обычный подзапрос

In [154]:
t = pd.DataFrame({'id':[1,1,2,2,3],
                  'name':['a','b','c','d','e']})

In [155]:
t

   id name
0   1    a
1   1    b
2   2    c
3   2    d
4   3    e

In [156]:
t.to_sql('dupl_test',con,index=False,if_exists='replace')

In [157]:
sql = '''select * from dupl_test t'''

In [158]:
select(sql)

   id name
0   1    a
1   1    b
2   2    c
3   2    d
4   3    e

In [159]:
sql = '''select t.id from dupl_test t
group by t.id
having count(1) > 1'''

In [160]:
select(sql)

   id
0   1
1   2

In [161]:
sql = '''select * from dupl_test t
where t.id in (select t.id from dupl_test t
group by t.id
having count(1) > 1)'''

In [162]:
select(sql)

   id name
0   1    a
1   1    b
2   2    c
3   2    d

In [163]:
sql = '''
drop table if exists dupls;
create table dupls as
select t.id from dupl_test t
group by t.id
having count(1) > 1'''

In [164]:
cur.executescript(sql)

In [165]:
sql = '''select * from dupls t'''

In [166]:
select(sql)

   id
0   1
1   2

In [167]:
sql = '''select * from dupl_test t
where t.id in dupls'''

In [168]:
select(sql)

   id name
0   1    a
1   1    b
2   2    c
3   2    d

In [169]:
sql = '''
select * from 

(select t.id,count(1) as cnt from dupl_test t
group by t.id) t

where t.cnt > 1
'''

In [170]:
select(sql)

   id  cnt
0   1    2
1   2    2

## CTE (with)

In [171]:
sql = '''
select * from (

select * from 

(select t.id,count(1) as cnt from dupl_test t
group by t.id) t

where t.cnt > 1) t

where t.id = 1
'''

In [172]:
select(sql)

   id  cnt
0   1    2

In [173]:
sql = '''
with id_cnt as (
select t.id,count(1) as cnt from dupl_test t
group by t.id),

id_cnt_2 as

(select * from id_cnt t
where t.cnt > 1)

select * from id_cnt_2 t
where t.id = 1

'''

In [174]:
select(sql)

   id  cnt
0   1    2

In [175]:
sql = f'''select 
t.purpose_cat,

count(1)

 from ({cat}) t
 group by t.purpose_cat'''

In [176]:
print(sql)

select
t.purpose_cat,

count(1)

 from (select t.purpose,

case when t.purpose like '%свадьб%' then 'свадьба'
when t.purpose like '%машин%' or t.purpose like '%авто%' then 'машина'
when t.purpose like '%недвиж%' then 'недвижимость'

else 'другое' end as purpose_cat

 from purpose t) t
 group by t.purpose_cat

In [177]:
sql = '''
with categories as (
select t.purpose,

case when t.purpose like '%свадьб%' then 'свадьба'
when t.purpose like '%машин%' or t.purpose like '%авто%' then 'машина'
when t.purpose like '%недвиж%' then 'недвижимость'

else 'другое' end as purpose_cat

 from purpose t)
 
 select t.purpose_cat,

count(1) from categories t
group by t.purpose_cat
'''

In [178]:
select(sql)

    purpose_cat  count(1)
0        другое         1
1        машина         6
2  недвижимость         2
3       свадьба         5

## Когда лучше создавать таблицы

In [179]:
sql = '''
drop table if exists categories;
create table categories as
select t.purpose,

case when t.purpose like '%свадьб%' then 'свадьба'
when t.purpose like '%машин%' or t.purpose like '%авто%' then 'машина'
when t.purpose like '%недвиж%' then 'недвижимость'

else 'другое' end as purpose_cat

 from purpose t'''

In [180]:
cur.executescript(sql)

In [181]:
sql = '''select * from categories t'''

In [182]:
select(sql)

                    purpose   purpose_cat
0                    машина        машина
1                    машина        машина
2                    машина        машина
3                 на машину        машина
4         на покупку машины        машина
5                автомобиль        машина
6       на возвращение 2007        другое
7                на свадьбу       свадьба
8                   свадьба       свадьба
9                   свадьба       свадьба
10                  свадьба       свадьба
11              для свадьбы       свадьба
12             недвижимость  недвижимость
13  на покупку недвижимости  недвижимость

In [183]:
sql = f'''select 
t.purpose_cat,

count(1)

 from categories t
 group by t.purpose_cat'''

In [184]:
select(sql)

    purpose_cat  count(1)
0        другое         1
1        машина         6
2  недвижимость         2
3       свадьба         5

In [185]:
sql = f'''select t.purpose, count(1) 

from categories t
where t.purpose_cat = 'другое'


group by t.purpose

order by count(1) desc'''

In [186]:
select(sql)

               purpose  count(1)
0  на возвращение 2007         1

In [187]:
sql = '''
with categories as (
select 1

 from purpose t)
 
 select * from categories t
'''

In [188]:
select(sql)

    1
0   1
1   1
2   1
3   1
4   1
5   1
6   1
7   1
8   1
9   1
10  1
11  1
12  1
13  1

# Джойны

## Лефт и иннер джоин

In [189]:
sql = '''select * from german_credit t limit 5'''

In [190]:
select(sql)

   age     sex  job housing  ...    purpose default          contract_dt  client_id
0   33    male    2     own  ...   radio/TV       0  2008-06-29 18:52:00        210
1   43    male    1     own  ...        car       0  2007-05-20 18:30:19        929
2   52    male    2     own  ...  education       0  2008-04-27 08:23:07        200
3   35  female    3     own  ...        car       0  2007-05-06 10:58:22         45
4   28    male    2     own  ...   radio/TV       0  2007-07-21 13:22:14        358

[5 rows x 12 columns]

In [191]:
users = pd.DataFrame({'id':[1,2,3],'name':['gleb','jon snow','tyrion']})

In [192]:
users

   id      name
0   1      gleb
1   2  jon snow
2   3    tyrion

In [193]:
items = pd.DataFrame({'user_id':[1,3,3],'item_name':['hleb','gold','wine'],'value':[5,100,20]})

In [194]:
items

   user_id item_name  value
0        1      hleb      5
1        3      gold    100
2        3      wine     20

In [195]:
users.to_sql('users',con,index=False,if_exists='replace')
items.to_sql('items',con,index=False,if_exists='replace')

In [196]:
sql = '''select t.*, i.item_name, i.value, i.user_id from users t
left join items i on t.id = i.user_id
'''

In [197]:
select(sql)

   id      name item_name  value  user_id
0   1      gleb      hleb    5.0      1.0
1   2  jon snow      None    NaN      NaN
2   3    tyrion      gold  100.0      3.0
3   3    tyrion      wine   20.0      3.0

In [198]:
sql = '''select t.*, i.item_name from users t
join items i on t.id = i.user_id
'''

In [199]:
select(sql)

   id    name item_name
0   1    gleb      hleb
1   3  tyrion      gold
2   3  tyrion      wine

In [200]:
sql = '''select t.*, i.item_name from users t
left join items i on t.id = i.user_id
where i.item_name is not null
'''

In [201]:
select(sql)

   id    name item_name
0   1    gleb      hleb
1   3  tyrion      gold
2   3  tyrion      wine

## Агрегируй перед тем как джойнить

In [202]:
users = pd.DataFrame({'id':[1,2,3],'name':['gleb','jon snow','tyrion'],
                      'victory':[2,10,1]})

In [203]:
users.to_sql('users',con,index=False,if_exists='replace')

In [204]:
sql = '''select t.*, i.item_name, i.value, i.user_id from users t
left join items i on t.id = i.user_id
'''

In [205]:
t = select(sql)

In [206]:
t

   id      name  victory item_name  value  user_id
0   1      gleb        2      hleb    5.0      1.0
1   2  jon snow       10      None    NaN      NaN
2   3    tyrion        1      gold  100.0      3.0
3   3    tyrion        1      wine   20.0      3.0

In [207]:
t['victory'].sum()

14

In [208]:
sql = '''select sum(t.victory) from users t'''

In [209]:
select(sql)

   sum(t.victory)
0              13

In [210]:
sql = '''select t.*, i.item_name, i.value, i.user_id from users t
join items i on t.id = i.user_id
'''

In [211]:
select(sql)

   id    name  victory item_name  value  user_id
0   1    gleb        2      hleb      5        1
1   3  tyrion        1      gold    100        3
2   3  tyrion        1      wine     20        3

In [212]:
sql = '''select t.id, t.name, 
t.victory,
count(i.item_name) as item_cnt,
coalesce(sum(i.value),0) as value_sum

from users t
left join items i on t.id = i.user_id
group by t.id, t.name, t.victory
'''

In [213]:
select(sql)

   id      name  victory  item_cnt  value_sum
0   1      gleb        2         1          5
1   2  jon snow       10         0          0
2   3    tyrion        1         2        120

In [214]:
sql = '''select t.user_id, count(t.item_name) as item_cnt,
sum(value) as value_sum from items t
group by t.user_id'''

In [215]:
select(sql)

   user_id  item_cnt  value_sum
0        1         1          5
1        3         2        120

In [216]:
sql = '''
with items_agg as (

select t.user_id, count(t.item_name) as item_cnt,
sum(value) as value_sum from items t
group by t.user_id)

select t.id, t.name,
t.victory,

coalesce(i.item_cnt,0) as item_cnt,
coalesce(i.value_sum,0) as value_sum

from users t

left join items_agg i on t.id = i.user_id

'''

In [217]:
select(sql)

   id      name  victory  item_cnt  value_sum
0   1      gleb        2         1          5
1   2  jon snow       10         0          0
2   3    tyrion        1         2        120

## Как не надо писать джойны

In [218]:
sql = '''
with items_agg as (

select t.user_id, count(t.item_name) as item_cnt,
sum(value) as value_sum from items t
group by t.user_id)

select t.id, t.name,
t.victory,

coalesce(item_cnt,0) as item_cnt,
coalesce(value_sum,0) as value_sum

from users t

left join items_agg i on t.id = i.user_id

'''

In [219]:
select(sql)

   id      name  victory  item_cnt  value_sum
0   1      gleb        2         1          5
1   2  jon snow       10         0          0
2   3    tyrion        1         2        120

In [220]:
items = pd.DataFrame({'id':[1,3,3],'item_name':['hleb','gold','wine'],'value':[5,100,20]})

In [221]:
items.to_sql('items2',con,index=False,if_exists='replace')

In [222]:
sql = '''select * from users t
left join items i on t.id = i.user_id'''

In [223]:
select(sql)

   id      name  victory  user_id item_name  value
0   1      gleb        2      1.0      hleb    5.0
1   2  jon snow       10      NaN      None    NaN
2   3    tyrion        1      3.0      gold  100.0
3   3    tyrion        1      3.0      wine   20.0

In [224]:
sql = '''select * from users t
left join items2 i  on t.id=i.id
'''

In [225]:
select(sql)

   id      name  victory   id item_name  value
0   1      gleb        2  1.0      hleb    5.0
1   2  jon snow       10  NaN      None    NaN
2   3    tyrion        1  3.0      gold  100.0
3   3    tyrion        1  3.0      wine   20.0

In [226]:
sql = '''select * from users
left join items2  using(id)
'''

In [227]:
select(sql)

   id      name  victory item_name  value
0   1      gleb        2      hleb    5.0
1   2  jon snow       10      None    NaN
2   3    tyrion        1      gold  100.0
3   3    tyrion        1      wine   20.0

In [228]:
sql = '''select * from 
users t, items2 i 
where t.id = i.id
'''

In [229]:
select(sql)

   id    name  victory  id item_name  value
0   1    gleb        2   1      hleb      5
1   3  tyrion        1   3      gold    100
2   3  tyrion        1   3      wine     20

## Никогда не используй right join!

In [230]:
users = pd.DataFrame({'id':[1,2,3],'name':['gleb','jon snow','tyrion']})

In [231]:
users

   id      name
0   1      gleb
1   2  jon snow
2   3    tyrion

In [232]:
items = pd.DataFrame({'user_id':[1,3,3,4],'item_name':['hleb','gold','wine','sword'],'value':[5,100,20,50]})

In [233]:
items

   user_id item_name  value
0        1      hleb      5
1        3      gold    100
2        3      wine     20
3        4     sword     50

In [234]:
users.to_sql('users',con,index=False,if_exists='replace')
items.to_sql('items',con,index=False,if_exists='replace')

In [235]:
sql = '''select t.*, i.* from users t
left join items i on t.id = i.user_id'''

In [236]:
select(sql)

   id      name  user_id item_name  value
0   1      gleb      1.0      hleb    5.0
1   2  jon snow      NaN      None    NaN
2   3    tyrion      3.0      gold  100.0
3   3    tyrion      3.0      wine   20.0

In [237]:
sql = '''select t.*, u.* 
from items t left join users u on t.user_id = u.id'''

In [238]:
select(sql)

   user_id item_name  value   id    name
0        1      hleb      5  1.0    gleb
1        3      gold    100  3.0  tyrion
2        3      wine     20  3.0  tyrion
3        4     sword     50  NaN    None

In [239]:
sql = '''select t.*, i.* from users t
right join items i on t.id = i.user_id'''

In [240]:
import csv
from io import StringIO

def psql_insert_copy(table, conn, keys, data_iter):
    # gets a DBAPI connection that can provide a cursor
    dbapi_conn = conn.connection
    with dbapi_conn.cursor() as cur:
        s_buf = StringIO()
        writer = csv.writer(s_buf)
        writer.writerows(data_iter)
        s_buf.seek(0)

        columns = ', '.join('"{}"'.format(k) for k in keys)
        if table.schema:
            table_name = '{}.{}'.format(table.schema, table.name)
        else:
            table_name = table.name

        sql = 'COPY {} ({}) FROM STDIN WITH CSV'.format(
            table_name, columns)
        cur.copy_expert(sql=sql, file=s_buf)

In [241]:
users.to_sql('users',con_pg,index=False,if_exists='replace',method=psql_insert_copy)
items.to_sql('items',con_pg,index=False,if_exists='replace',method=psql_insert_copy)

In [242]:
sql = '''select t.*, i.* from users t
right join items i on t.id = i.user_id'''

In [243]:
select_pg(sql)

    id    name  user_id item_name  value
0  1.0    gleb        1      hleb      5
1  3.0  tyrion        3      gold    100
2  3.0  tyrion        3      wine     20
3  NaN    None        4     sword     50

## Full join

In [244]:
sql = '''select t.*, i.* from users t
full join items i on t.id = i.user_id'''

In [245]:
select_pg(sql)

    id      name  user_id item_name  value
0  1.0      gleb      1.0      hleb    5.0
1  2.0  jon snow      NaN      None    NaN
2  3.0    tyrion      3.0      gold  100.0
3  3.0    tyrion      3.0      wine   20.0
4  NaN      None      4.0     sword   50.0

Если вдруг не можешь вспомнить как делать full join (да и вообще что либо) -- всегда гугли. https://stackoverflow.com/questions/1923259/full-outer-join-with-sqlite

In [246]:
sql = '''select t.*, i.* from users t
left join items i on t.id = i.user_id
union 
select u.*, t.* 
from items t left join users u on t.user_id = u.id
'''

In [247]:
select(sql)

    id      name  user_id item_name  value
0  NaN      None      4.0     sword   50.0
1  1.0      gleb      1.0      hleb    5.0
2  2.0  jon snow      NaN      None    NaN
3  3.0    tyrion      3.0      gold  100.0
4  3.0    tyrion      3.0      wine   20.0

## Inner join

In [248]:
sql = '''select * from german_credit t 
limit 5'''

In [249]:
select(sql)

   age     sex  job housing  ...    purpose default          contract_dt  client_id
0   33    male    2     own  ...   radio/TV       0  2008-06-29 18:52:00        210
1   43    male    1     own  ...        car       0  2007-05-20 18:30:19        929
2   52    male    2     own  ...  education       0  2008-04-27 08:23:07        200
3   35  female    3     own  ...        car       0  2007-05-06 10:58:22         45
4   28    male    2     own  ...   radio/TV       0  2007-07-21 13:22:14        358

[5 rows x 12 columns]

In [250]:
clients = pd.DataFrame({'client_id':[200,45],'data':[1,2]})

In [251]:
clients.to_sql('clients_task_name',con,index=False,if_exists='replace')

In [252]:
sql = '''select t.*, ctn.data from german_credit t 
join clients_task_name ctn on t.client_id = ctn.client_id
'''

In [253]:
select(sql)

   age     sex  job housing  ... default          contract_dt  client_id  data
0   52    male    2     own  ...       0  2008-04-27 08:23:07        200     1
1   35  female    3     own  ...       0  2007-05-06 10:58:22         45     2

[2 rows x 13 columns]

In [254]:
sql = '''select 1 as user_id
union all
select 2 as user_id
union all
select 3 as user_id'''

In [255]:
select(sql)

   user_id
0        1
1        2
2        3

In [256]:
sql = '''select date('2021-03-01') as month
union all
select date('2021-04-01') as month
'''

In [257]:
select(sql)

        month
0  2021-03-01
1  2021-04-01

In [258]:
sql = '''
with users as (
select 1 as user_id
union all
select 2 as user_id
union all
select 3 as user_id),

month as

(select date('2021-03-01') as month
union all
select date('2021-04-01') as month)


select * from users t
join month m on 1=1

'''

In [259]:
select(sql)

   user_id       month
0        1  2021-03-01
1        2  2021-03-01
2        3  2021-03-01
3        1  2021-04-01
4        2  2021-04-01
5        3  2021-04-01

## Ежемесячный отчет

In [260]:
sql = '''select * from german_credit t 
limit 5'''

In [261]:
select(sql)

   age     sex  job housing  ...    purpose default          contract_dt  client_id
0   33    male    2     own  ...   radio/TV       0  2008-06-29 18:52:00        210
1   43    male    1     own  ...        car       0  2007-05-20 18:30:19        929
2   52    male    2     own  ...  education       0  2008-04-27 08:23:07        200
3   35  female    3     own  ...        car       0  2007-05-06 10:58:22         45
4   28    male    2     own  ...   radio/TV       0  2007-07-21 13:22:14        358

[5 rows x 12 columns]

https://drive.google.com/file/d/1ksjv4EsLItdn9rYA4oxislish-c4eE4D/view?usp=sharing

In [268]:
! gdown --id 1ksjv4EsLItdn9rYA4oxislish-c4eE4D

Downloading...
From: https://drive.google.com/uc?id=1ksjv4EsLItdn9rYA4oxislish-c4eE4D
To: /content/german_credit_augmented_transactions.csv
100% 134k/134k [00:00<00:00, 16.6MB/s]

In [269]:
transactions = pd.read_csv('/content/german_credit_augmented_transactions.csv')

In [270]:
transactions.head()

                    dt  client_id  amount
0  2008-04-06 11:54:47        950  161.38
1  2007-07-28 00:00:19        418   35.34
2  2008-03-14 20:43:54        131  146.50
3  2007-12-18 13:03:24        353  119.21
4  2007-11-09 05:18:30        849  105.24

In [271]:
transactions.to_sql('client_transactions',con,index=False,if_exists='replace')

In [286]:
sql = '''select * from client_transactions t limit 5'''

In [287]:
select(sql)

                    dt  client_id  amount
0  2008-04-06 11:54:47        950  161.38
1  2007-07-28 00:00:19        418   35.34
2  2008-03-14 20:43:54        131  146.50
3  2007-12-18 13:03:24        353  119.21
4  2007-11-09 05:18:30        849  105.24

In [288]:
sql = '''select count(*) from client_transactions t limit 5'''

In [289]:
select(sql)

   count(*)
0      4275

In [296]:
sql = '''select 
date(t.dt, 'start of month') as month,
count(1) as transaction_cnt,
sum(t.amount) as amount_sum

 from client_transactions t
group by 1
order by 1
'''

In [297]:
select(sql)

         month  transaction_cnt  amount_sum
0   2007-05-01              338   450912.77
1   2007-06-01              379   551664.83
2   2007-07-01              304   494134.50
3   2007-08-01              255   426903.23
4   2007-10-01              332   634846.49
5   2007-11-01              389   500420.98
6   2007-12-01              364   561449.89
7   2008-01-01              413   630137.22
8   2008-02-01              228   337043.47
9   2008-03-01              309   425599.09
10  2008-04-01              383   677194.97
11  2008-05-01              310   474962.34
12  2008-06-01              271   383710.84

In [312]:
min = '''select date(min(t.dt),'start of month') from client_transactions t'''

In [315]:
max = '''select date(max(t.dt),'start of month') from client_transactions t'''

In [316]:
select(max)

  date(max(t.dt),'start of month')
0                       2008-06-01

In [317]:
sql = f'''WITH RECURSIVE dates(month) AS (
  VALUES(({min}))
  UNION ALL
  SELECT date(month, '+1 month')
  FROM dates
  WHERE month < ({max})
)
SELECT t.month FROM dates t'''

In [318]:
select(sql)

         month
0   2007-05-01
1   2007-06-01
2   2007-07-01
3   2007-08-01
4   2007-09-01
5   2007-10-01
6   2007-11-01
7   2007-12-01
8   2008-01-01
9   2008-02-01
10  2008-03-01
11  2008-04-01
12  2008-05-01
13  2008-06-01

In [325]:
sql = f'''WITH dates(month) AS (
  VALUES(({min}))
  UNION ALL
  SELECT date(month, '+1 month')
  FROM dates
  WHERE month < ({max})
),
trans_month as

(select 
date(t.dt, 'start of month') as month,
count(1) as transaction_cnt,
sum(t.amount) as amount_sum

 from client_transactions t
group by 1
order by 1)


SELECT t.month,
coalesce(tm.transaction_cnt,0) as transaction_cnt,
coalesce(tm.amount_sum,0) as amount_sum

FROM dates t
left join trans_month tm on t.month = tm.month
order by t.month'''

In [326]:
select(sql)

         month  transaction_cnt  amount_sum
0   2007-05-01              338   450912.77
1   2007-06-01              379   551664.83
2   2007-07-01              304   494134.50
3   2007-08-01              255   426903.23
4   2007-09-01                0        0.00
5   2007-10-01              332   634846.49
6   2007-11-01              389   500420.98
7   2007-12-01              364   561449.89
8   2008-01-01              413   630137.22
9   2008-02-01              228   337043.47
10  2008-03-01              309   425599.09
11  2008-04-01              383   677194.97
12  2008-05-01              310   474962.34
13  2008-06-01              271   383710.84

## Ежемесячный отчет на пользователя

In [331]:
sql = '''select distinct t.client_id from german_credit t'''

In [332]:
select(sql)

     client_id
0          210
1          929
2          200
3           45
4          358
..         ...
995        624
996        181
997        730
998        557
999         23

[1000 rows x 1 columns]

In [349]:
sql = '''select 
date(t.dt, 'start of month') as month,
t.client_id,
count(1) as transaction_cnt,
sum(t.amount) as amount_sum

 from client_transactions t
group by 1,2
order by 1'''

In [350]:
select(sql)

           month  client_id  transaction_cnt  amount_sum
0     2007-05-01        101                1      149.67
1     2007-05-01        107                2      217.50
2     2007-05-01        110                1     1081.32
3     2007-05-01        111                1      139.97
4     2007-05-01        113                1     1051.29
...          ...        ...              ...         ...
3551  2008-06-01        983                1    10050.37
3552  2008-06-01        987                1      192.48
3553  2008-06-01        992                1     -610.21
3554  2008-06-01        996                1      121.28
3555  2008-06-01        999                1     -641.25

[3556 rows x 4 columns]

In [372]:
sql = f'''WITH dates(month) AS (
  VALUES(({min}))
  UNION ALL
  SELECT date(month, '+1 month')
  FROM dates
  WHERE month < ({max})
),

clients as (select distinct t.client_id from german_credit t),

clients_month as

(SELECT t.month, c.client_id FROM dates t
join clients c on 1=1),

trans_month as 

(select 
date(t.dt, 'start of month') as month,
t.client_id,
count(1) as transaction_cnt,
sum(t.amount) as amount_sum

 from client_transactions t
group by 1,2
order by 1),

client_trans_month as (

select t.*,
tm.transaction_cnt,
tm.amount_sum,
1 as user,
case when tm.transaction_cnt > 0 then 1 else 0 end as active

 from clients_month t
left join trans_month tm on t.client_id = tm.client_id
and t.month = tm.month
)

select t.month, sum(t.user) as user_cnt, sum(t.amount_sum) as amount_sum , 
sum(t.active) as active_cnt from client_trans_month t
group by t.month
'''

In [374]:
t = select(sql)

In [370]:
sql = '''select sum(t.amount) from client_transactions t'''

In [371]:
select(sql)

   sum(t.amount)
0     6548980.62

In [376]:
t['amount_sum'].sum()

6548980.619999999

In [377]:
t

         month  user_cnt  amount_sum  active_cnt
0   2007-05-01      1000   450912.77         288
1   2007-06-01      1000   551664.83         297
2   2007-07-01      1000   494134.50         259
3   2007-08-01      1000   426903.23         222
4   2007-09-01      1000         NaN           0
5   2007-10-01      1000   634846.49         283
6   2007-11-01      1000   500420.98         323
7   2007-12-01      1000   561449.89         287
8   2008-01-01      1000   630137.22         325
9   2008-02-01      1000   337043.47         204
10  2008-03-01      1000   425599.09         267
11  2008-04-01      1000   677194.97         301
12  2008-05-01      1000   474962.34         263
13  2008-06-01      1000   383710.84         237

In [383]:
2 * 365 * 10000

7300000